In [158]:
import pandas as pd

In [160]:
raw_df=pd.read_csv(r"C:\Users\Harshdeep\Desktop\data analytics\18nov\raw_data.csv") # read raw data file

In [162]:
raw_df

                                           ADDR          DT NAME     time
0  45 rd, kenith street, btm, bangalore, 500038  2022-04-03  abc  8:30:21
1            45 rd,  street, hitech, Hd ,500038  2022-04-02  dec  5:30:21

In [164]:
raw_df.index

RangeIndex(start=0, stop=2, step=1)

In [211]:
raw_df.info

<bound method DataFrame.info of                                            ADDR          DT NAME     time  \
0  45 rd, kenith street, btm, bangalore, 500038  2022-04-03  abc  8:30:21
1            45 rd,  street, hitech, Hd ,500038  2022-04-02  dec  5:30:21

  House add          street     city       state      zip
0     45 rd   kenith street      btm   bangalore   500038
1     45 rd          street   hitech         Hd    500038  >

In [213]:
raw_df.columns

Index(['ADDR', 'DT', 'NAME', 'time', 'House add', 'street', 'city', 'state',
       'zip'],
      dtype='object')

In [215]:
raw_df['ADDR']

0    45 rd, kenith street, btm, bangalore, 500038
1              45 rd,  street, hitech, Hd ,500038
Name: ADDR, dtype: object

In [217]:
raw_df.ADDR[0]

'45 rd, kenith street, btm, bangalore, 500038'

In [219]:
raw_df.DT[0]

'2022-04-03'

In [221]:
raw_df.NAME[0]

'abc'

In [223]:
raw_df.time[0]

'8:30:21'

In [225]:
raw_df[["House add","street","city","state","zip"]] = raw_df.ADDR.str.split(",",expand=True) # split adress column by using str.split function
print(raw_df)

                                           ADDR          DT NAME     time  \
0  45 rd, kenith street, btm, bangalore, 500038  2022-04-03  abc  8:30:21
1            45 rd,  street, hitech, Hd ,500038  2022-04-02  dec  5:30:21

  House add          street     city       state      zip
0     45 rd   kenith street      btm   bangalore   500038
1     45 rd          street   hitech         Hd    500038

In [229]:
raw_df[["Year","Month","Date"]] = raw_df.DT.str.split("-", expand=True) # split DT column
print(raw_df)

                                           ADDR          DT NAME     time  \
0  45 rd, kenith street, btm, bangalore, 500038  2022-04-03  abc  8:30:21
1            45 rd,  street, hitech, Hd ,500038  2022-04-02  dec  5:30:21

  House add          street     city       state      zip  Year Month Date
0     45 rd   kenith street      btm   bangalore   500038  2022    04   03
1     45 rd          street   hitech         Hd    500038  2022    04   02

In [116]:
raw_df[["minute","second","ms"]] = raw_df.time.str.split(":", expand=True) # split time column
print(raw_df)

                                           ADDR          DT NAME     time  \
0  45 rd, kenith street, btm, bangalore, 500038  2022-04-03  abc  8:30:21
1            45 rd,  street, hitech, Hd .500038  2022-04-02  dec  5:30:21

  House add          street     city        state      zip  Year Month Day  \
0     45 rd   kenith street      btm    bangalore   500038  2022    04  03
1     45 rd          street   hitech   Hd .500038     None  2022    04  02

  minute second  ms
0      8     30  21
1      5     30  21

In [235]:
raw_df = raw_df.drop(columns=['ADDR']) # drop the Addr column
raw_df.head()

,DT,NAME,time,House add,street,city,state,zip,Year,Month,Date
0,2022-04-03,abc,8:30:21,45 rd,kenith street,btm,bangalore,500038,2022,04,03
1,2022-04-02,dec,5:30:21,45 rd,street,hitech,Hd,500038,2022,04,02

In [237]:
raw_df = raw_df.drop(columns=['DT']) # drop the DT column
raw_df.head()

,NAME,time,House add,street,city,state,zip,Year,Month,Date
0,abc,8:30:21,45 rd,kenith street,btm,bangalore,500038,2022,04,03
1,dec,5:30:21,45 rd,street,hitech,Hd,500038,2022,04,02

In [239]:
raw_df = raw_df.drop(columns=['time']) # drop the time column
raw_df.head()

,NAME,House add,street,city,state,zip,Year,Month,Date
0,abc,45 rd,kenith street,btm,bangalore,500038,2022,04,03
1,dec,45 rd,street,hitech,Hd,500038,2022,04,02

In [241]:
raw_df.to_csv(r"C:\Users\Harshdeep\Desktop\data analytics\18nov\clean_dtt.csv") # write clean data tp csv file